shared_with_qemu/pi_fio_results/noiomap_4G_mem_read_bs-100M_20250814-224439.log
buffered-read: (g=0): rw=read, bs=(R) 100MiB-100MiB, (W) 100MiB-100MiB, (T) 100MiB-100MiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=2936: Thu Aug 14 22:44:41 2025
  read: IOPS=3, BW=396MiB/s (415MB/s)(600MiB/1517msec)
    clat (msec): min=251, max=259, avg=252.69, stdev= 3.12
     lat (msec): min=251, max=259, avg=252.69, stdev= 3.12
    clat percentiles (msec):
     |  1.00th=[  251],  5.00th=[  251], 10.00th=[  251], 20.00th=[  251],
     | 30.00th=[  251], 40.00th=[  251], 50.00th=[  251], 60.00th=[  251],
     | 70.00th=[  253], 80.00th=[  253], 90.00th=[  259], 95.00th=[  259],
     | 99.00th=[  259], 99.50th=[  259], 99.90th=[  259], 99.95th=[  259],
     | 99.99th=[  259]
   bw (  KiB/s): min=204800, max=409600, per=84.28%, avg=341333.33, stdev=118241.34, samples=3
   iops        : min=    2, max=    4, avg= 3.33, stdev= 1.15, samples=3
  lat (msec)   : 500=100.00%
  cpu          : usr=0.00%, sys=35.95%, ctx=2400, majf=0, minf=265
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=396MiB/s (415MB/s), 396MiB/s-396MiB/s (415MB/s-415MB/s), io=600MiB (629MB), run=1517-1517msec

Disk stats (read/write):
  nvme0n1: ios=4440/0, merge=89/0, ticks=3937/0, in_queue=3937, util=60.88%