shared_with_qemu/pi_fio_results/noiomap_4G_mem_read_bs-128k_20250814-224543.log
buffered-read: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=3540: Thu Aug 14 22:45:44 2025
  read: IOPS=3177, BW=397MiB/s (417MB/s)(512MiB/1289msec)
    clat (usec): min=10, max=1490, avg=313.88, stdev=347.48
     lat (usec): min=10, max=1490, avg=313.95, stdev=347.46
    clat percentiles (usec):
     |  1.00th=[   11],  5.00th=[   11], 10.00th=[   11], 20.00th=[   12],
     | 30.00th=[   13], 40.00th=[   14], 50.00th=[   60], 60.00th=[  388],
     | 70.00th=[  578], 80.00th=[  701], 90.00th=[  816], 95.00th=[  930],
     | 99.00th=[ 1057], 99.50th=[ 1090], 99.90th=[ 1156], 99.95th=[ 1172],
     | 99.99th=[ 1483]
   bw (  KiB/s): min=406016, max=408064, per=100.00%, avg=407040.00, stdev=1448.15, samples=2
   iops        : min= 3172, max= 3188, avg=3180.00, stdev=11.31, samples=2
  lat (usec)   : 20=49.58%, 50=0.37%, 100=0.59%, 250=4.44%, 500=9.18%
  lat (usec)   : 750=20.87%, 1000=12.60%
  lat (msec)   : 2=2.37%
  cpu          : usr=0.31%, sys=6.75%, ctx=2049, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4096,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=397MiB/s (417MB/s), 397MiB/s-397MiB/s (417MB/s-417MB/s), io=512MiB (537MB), run=1289-1289msec

Disk stats (read/write):
  nvme0n1: ios=3666/0, merge=89/0, ticks=3921/0, in_queue=3921, util=86.86%