shared_with_qemu/pi_fio_results/noiomap_4G_mem_write_bs-100M_20250811-191539.log
buffered-write: (g=0): rw=write, bs=(R) 100MiB-100MiB, (W) 100MiB-100MiB, (T) 100MiB-100MiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=4701: Mon Aug 11 19:15:40 2025
  write: IOPS=15, BW=1508MiB/s (1582MB/s)(1000MiB/663msec); 0 zone resets
    clat (usec): min=51065, max=62637, avg=55495.70, stdev=3147.31
     lat (usec): min=57862, max=72562, avg=64906.36, stdev=4183.80
    clat percentiles (usec):
     |  1.00th=[51119],  5.00th=[51119], 10.00th=[51119], 20.00th=[52691],
     | 30.00th=[53216], 40.00th=[54789], 50.00th=[54789], 60.00th=[55313],
     | 70.00th=[55837], 80.00th=[56361], 90.00th=[57934], 95.00th=[62653],
     | 99.00th=[62653], 99.50th=[62653], 99.90th=[62653], 99.95th=[62653],
     | 99.99th=[62653]
   bw (  MiB/s): min= 1397, max= 1397, per=92.63%, avg=1397.21, stdev= 0.00, samples=1
   iops        : min=   13, max=   13, avg=13.00, stdev= 0.00, samples=1
  lat (msec)   : 100=100.00%
  cpu          : usr=14.50%, sys=85.65%, ctx=29, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,10,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1508MiB/s (1582MB/s), 1508MiB/s-1508MiB/s (1582MB/s-1582MB/s), io=1000MiB (1049MB), run=663-663msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%