shared_with_qemu/pi_fio_results/noiomap_4G_mem_write_bs-100M_20250811-191546.log
buffered-write: (g=0): rw=write, bs=(R) 100MiB-100MiB, (W) 100MiB-100MiB, (T) 100MiB-100MiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=4857: Mon Aug 11 19:15:47 2025
  write: IOPS=12, BW=1276MiB/s (1337MB/s)(1000MiB/784msec); 0 zone resets
    clat (usec): min=62636, max=71357, avg=67273.31, stdev=2987.91
     lat (usec): min=69089, max=85010, avg=77012.65, stdev=4324.01
    clat percentiles (usec):
     |  1.00th=[62653],  5.00th=[62653], 10.00th=[62653], 20.00th=[64226],
     | 30.00th=[64750], 40.00th=[65799], 50.00th=[66847], 60.00th=[67634],
     | 70.00th=[68682], 80.00th=[70779], 90.00th=[70779], 95.00th=[71828],
     | 99.00th=[71828], 99.50th=[71828], 99.90th=[71828], 99.95th=[71828],
     | 99.99th=[71828]
   bw (  MiB/s): min= 1200, max= 1200, per=94.08%, avg=1200.00, stdev= 0.00, samples=1
   iops        : min=   12, max=   12, avg=12.00, stdev= 0.00, samples=1
  lat (msec)   : 100=100.00%
  cpu          : usr=11.75%, sys=88.12%, ctx=18, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,10,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1276MiB/s (1337MB/s), 1276MiB/s-1276MiB/s (1337MB/s-1337MB/s), io=1000MiB (1049MB), run=784-784msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%