shared_with_qemu/pi_fio_results/noiomap_4G_mem_write_bs-1M_20250811-191521.log
buffered-write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=4232: Mon Aug 11 19:15:22 2025
  write: IOPS=1667, BW=1668MiB/s (1749MB/s)(1024MiB/614msec); 0 zone resets
    clat (usec): min=392, max=1068, avg=566.87, stdev=72.42
     lat (usec): min=407, max=1196, avg=584.01, stdev=73.93
    clat percentiles (usec):
     |  1.00th=[  404],  5.00th=[  424], 10.00th=[  457], 20.00th=[  502],
     | 30.00th=[  545], 40.00th=[  570], 50.00th=[  594], 60.00th=[  603],
     | 70.00th=[  611], 80.00th=[  619], 90.00th=[  635], 95.00th=[  644],
     | 99.00th=[  709], 99.50th=[  750], 99.90th=[ 1020], 99.95th=[ 1074],
     | 99.99th=[ 1074]
   bw (  MiB/s): min= 1672, max= 1672, per=100.00%, avg=1672.00, stdev= 0.00, samples=1
   iops        : min= 1672, max= 1672, avg=1672.00, stdev= 0.00, samples=1
  lat (usec)   : 500=19.73%, 750=79.79%, 1000=0.29%
  lat (msec)   : 2=0.20%
  cpu          : usr=2.45%, sys=96.74%, ctx=60, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1668MiB/s (1749MB/s), 1668MiB/s-1668MiB/s (1749MB/s-1749MB/s), io=1024MiB (1074MB), run=614-614msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%