shared_with_qemu/pi_fio_results/noiomap_4G_mem_write_bs-4k_20250811-191617.log
buffered-write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=5378: Mon Aug 11 19:16:19 2025
  write: IOPS=261k, BW=1020MiB/s (1069MB/s)(1024MiB/1004msec); 0 zone resets
    clat (nsec): min=1908, max=400526, avg=3363.80, stdev=1349.91
     lat (nsec): min=2000, max=400618, avg=3458.01, stdev=1351.57
    clat percentiles (nsec):
     |  1.00th=[ 2384],  5.00th=[ 2544], 10.00th=[ 2672], 20.00th=[ 2864],
     | 30.00th=[ 3024], 40.00th=[ 3216], 50.00th=[ 3376], 60.00th=[ 3504],
     | 70.00th=[ 3664], 80.00th=[ 3792], 90.00th=[ 3952], 95.00th=[ 4128],
     | 99.00th=[ 4512], 99.50th=[ 4704], 99.90th=[ 7520], 99.95th=[11840],
     | 99.99th=[22912]
   bw (  KiB/s): min=1019072, max=1073424, per=100.00%, avg=1046248.00, stdev=38432.67, samples=2
   iops        : min=254768, max=268356, avg=261562.00, stdev=9608.17, samples=2
  lat (usec)   : 2=0.01%, 4=90.80%, 10=9.12%, 20=0.06%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=14.26%, sys=85.34%, ctx=19, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1020MiB/s (1069MB/s), 1020MiB/s-1020MiB/s (1069MB/s-1069MB/s), io=1024MiB (1074MB), run=1004-1004msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%