shared_with_qemu/pi_fio_results/noiomap_com_4G_mem_read_bs-128k_20250815-065752.log
buffered-read: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=3433: Fri Aug 15 06:57:54 2025
  read: IOPS=3175, BW=397MiB/s (416MB/s)(512MiB/1290msec)
    clat (usec): min=26, max=859, avg=313.92, stdev=84.95
     lat (usec): min=26, max=859, avg=314.01, stdev=84.95
    clat percentiles (usec):
     |  1.00th=[   77],  5.00th=[  112], 10.00th=[  314], 20.00th=[  314],
     | 30.00th=[  314], 40.00th=[  314], 50.00th=[  314], 60.00th=[  314],
     | 70.00th=[  314], 80.00th=[  314], 90.00th=[  322], 95.00th=[  498],
     | 99.00th=[  553], 99.50th=[  553], 99.90th=[  570], 99.95th=[  627],
     | 99.99th=[  857]
   bw (  KiB/s): min=406272, max=407296, per=100.00%, avg=406784.00, stdev=724.08, samples=2
   iops        : min= 3174, max= 3182, avg=3178.00, stdev= 5.66, samples=2
  lat (usec)   : 50=0.05%, 100=4.81%, 250=3.59%, 500=86.65%, 750=4.88%
  lat (usec)   : 1000=0.02%
  cpu          : usr=0.31%, sys=9.23%, ctx=4103, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4096,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=397MiB/s (416MB/s), 397MiB/s-397MiB/s (416MB/s-416MB/s), io=512MiB (537MB), run=1290-1290msec

Disk stats (read/write):
  nvme0n1: ios=3671/0, merge=89/0, ticks=2198/0, in_queue=2199, util=83.33%