shared_with_qemu/pi_fio_results/noiomap_com_4G_mem_read_bs-1M_20250815-065651.log
buffered-read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=2339: Fri Aug 15 06:56:52 2025
  read: IOPS=386, BW=387MiB/s (406MB/s)(512MiB/1323msec)
    clat (usec): min=2373, max=4554, avg=2578.39, stdev=213.04
     lat (usec): min=2374, max=4555, avg=2578.88, stdev=213.12
    clat percentiles (usec):
     |  1.00th=[ 2442],  5.00th=[ 2474], 10.00th=[ 2507], 20.00th=[ 2507],
     | 30.00th=[ 2507], 40.00th=[ 2507], 50.00th=[ 2507], 60.00th=[ 2507],
     | 70.00th=[ 2507], 80.00th=[ 2540], 90.00th=[ 2802], 95.00th=[ 3032],
     | 99.00th=[ 3458], 99.50th=[ 3982], 99.90th=[ 4555], 99.95th=[ 4555],
     | 99.99th=[ 4555]
   bw (  KiB/s): min=378880, max=407552, per=99.23%, avg=393216.00, stdev=20274.17, samples=2
   iops        : min=  370, max=  398, avg=384.00, stdev=19.80, samples=2
  lat (msec)   : 4=99.61%, 10=0.39%
  cpu          : usr=0.30%, sys=15.43%, ctx=4041, majf=0, minf=70
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=512,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=387MiB/s (406MB/s), 387MiB/s-387MiB/s (406MB/s-406MB/s), io=512MiB (537MB), run=1323-1323msec

Disk stats (read/write):
  nvme0n1: ios=3766/0, merge=566/0, ticks=2282/0, in_queue=2282, util=78.21%