shared_with_qemu/pi_fio_results/noiomap_com_4G_mem_read_bs-4k_20250815-065737.log
buffered-read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=3253: Fri Aug 15 06:57:39 2025
  read: IOPS=102k, BW=397MiB/s (416MB/s)(512MiB/1290msec)
    clat (nsec): min=648, max=587741, avg=9507.31, stdev=48558.94
     lat (nsec): min=703, max=587797, avg=9558.60, stdev=48558.79
    clat percentiles (nsec):
     |  1.00th=[   668],  5.00th=[   668], 10.00th=[   684], 20.00th=[   684],
     | 30.00th=[   708], 40.00th=[   724], 50.00th=[   836], 60.00th=[   852],
     | 70.00th=[   868], 80.00th=[   892], 90.00th=[  1032], 95.00th=[  1128],
     | 99.00th=[280576], 99.50th=[280576], 99.90th=[280576], 99.95th=[288768],
     | 99.99th=[460800]
   bw (  KiB/s): min=405440, max=407192, per=99.97%, avg=406316.00, stdev=1238.85, samples=2
   iops        : min=101360, max=101798, avg=101579.00, stdev=309.71, samples=2
  lat (nsec)   : 750=42.14%, 1000=46.63%
  lat (usec)   : 2=8.08%, 4=0.01%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=3.10%, 750=0.01%
  cpu          : usr=4.73%, sys=12.49%, ctx=4105, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131072,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=397MiB/s (416MB/s), 397MiB/s-397MiB/s (416MB/s-416MB/s), io=512MiB (537MB), run=1290-1290msec

Disk stats (read/write):
  nvme0n1: ios=3668/0, merge=89/0, ticks=2120/0, in_queue=2120, util=75.00%